HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_GETH_MAC_CONFIGURATION_BE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_GETH_MAC_CONFIGURATION_BE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_GETH_MAC_CONFIGURATION_BE_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_GETH_MAC_CONFIGURATION_WD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_GETH_MAC_CONFIGURATION_WD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_GETH_MAC_CONFIGURATION_WD_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_GETH_MAC_CONFIGURATION_ACS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_GETH_MAC_CONFIGURATION_ACS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_GETH_MAC_CONFIGURATION_ACS_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_GETH_MAC_CONFIGURATION_CST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_GETH_MAC_CONFIGURATION_CST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_GETH_MAC_CONFIGURATION_CST_OFF (21u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.S2KP */
#define IFX_GETH_MAC_CONFIGURATION_S2KP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.S2KP */
#define IFX_GETH_MAC_CONFIGURATION_S2KP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.S2KP */
#define IFX_GETH_MAC_CONFIGURATION_S2KP_OFF (22u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.GPSLCE */
#define IFX_GETH_MAC_CONFIGURATION_GPSLCE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.GPSLCE */
#define IFX_GETH_MAC_CONFIGURATION_GPSLCE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.GPSLCE */
#define IFX_GETH_MAC_CONFIGURATION_GPSLCE_OFF (23u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.IPG */
#define IFX_GETH_MAC_CONFIGURATION_IPG_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.IPG */
#define IFX_GETH_MAC_CONFIGURATION_IPG_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.IPG */
#define IFX_GETH_MAC_CONFIGURATION_IPG_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_GETH_MAC_CONFIGURATION_IPC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_GETH_MAC_CONFIGURATION_IPC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_GETH_MAC_CONFIGURATION_IPC_OFF (27u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_GETH_MAC_CONFIGURATION_SARC_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_GETH_MAC_CONFIGURATION_SARC_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_GETH_MAC_CONFIGURATION_SARC_OFF (28u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.GPSL */
#define IFX_GETH_MAC_EXT_CONFIGURATION_GPSL_LEN (14u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.GPSL */
#define IFX_GETH_MAC_EXT_CONFIGURATION_GPSL_MSK (0x3fffu)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.GPSL */
#define IFX_GETH_MAC_EXT_CONFIGURATION_GPSL_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.DCRCC */
#define IFX_GETH_MAC_EXT_CONFIGURATION_DCRCC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.DCRCC */
#define IFX_GETH_MAC_EXT_CONFIGURATION_DCRCC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.DCRCC */
#define IFX_GETH_MAC_EXT_CONFIGURATION_DCRCC_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.SPEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_SPEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.SPEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_SPEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.SPEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_SPEN_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.USP */
#define IFX_GETH_MAC_EXT_CONFIGURATION_USP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.USP */
#define IFX_GETH_MAC_EXT_CONFIGURATION_USP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.USP */
#define IFX_GETH_MAC_EXT_CONFIGURATION_USP_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.HDSMS */
#define IFX_GETH_MAC_EXT_CONFIGURATION_HDSMS_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.HDSMS */
#define IFX_GETH_MAC_EXT_CONFIGURATION_HDSMS_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.HDSMS */
#define IFX_GETH_MAC_EXT_CONFIGURATION_HDSMS_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPGEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPGEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPGEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPGEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPGEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPGEN_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPG */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPG_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPG */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPG_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPG */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPG_OFF (25u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.FHE */
#define IFX_GETH_MAC_EXT_CONFIGURATION_FHE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.FHE */
#define IFX_GETH_MAC_EXT_CONFIGURATION_FHE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.FHE */
#define IFX_GETH_MAC_EXT_CONFIGURATION_FHE_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.PR */
#define IFX_GETH_MAC_PACKET_FILTER_PR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.PR */
#define IFX_GETH_MAC_PACKET_FILTER_PR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.PR */
#define IFX_GETH_MAC_PACKET_FILTER_PR_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.DAIF */
#define IFX_GETH_MAC_PACKET_FILTER_DAIF_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PACKET_FILTER_Bits.DAIF */
#define IFX_GETH_MAC_PACKET_FILTER_DAIF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PACKET_FILTER_Bits.DAIF */
#define IFX_GETH_MAC_PACKET_FILTER_DAIF_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_PACKET_FILTER_Bits.PM */
#define IFX_GETH_MAC_PACKET_FILTER_PM_LEN (1u)

