HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL1_Bits.UPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_UPQ_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL1_Bits.MCBCQ */
#define IFX_GETH_MAC_RXQ_CTRL1_MCBCQ_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL1_Bits.MCBCQ */
#define IFX_GETH_MAC_RXQ_CTRL1_MCBCQ_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL1_Bits.MCBCQ */
#define IFX_GETH_MAC_RXQ_CTRL1_MCBCQ_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL1_Bits.MCBCQEN */
#define IFX_GETH_MAC_RXQ_CTRL1_MCBCQEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL1_Bits.MCBCQEN */
#define IFX_GETH_MAC_RXQ_CTRL1_MCBCQEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL1_Bits.MCBCQEN */
#define IFX_GETH_MAC_RXQ_CTRL1_MCBCQEN_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL1_Bits.TACPQE */
#define IFX_GETH_MAC_RXQ_CTRL1_TACPQE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL1_Bits.TACPQE */
#define IFX_GETH_MAC_RXQ_CTRL1_TACPQE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL1_Bits.TACPQE */
#define IFX_GETH_MAC_RXQ_CTRL1_TACPQE_OFF (21u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL1_Bits.TPQC */
#define IFX_GETH_MAC_RXQ_CTRL1_TPQC_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL1_Bits.TPQC */
#define IFX_GETH_MAC_RXQ_CTRL1_TPQC_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL1_Bits.TPQC */
#define IFX_GETH_MAC_RXQ_CTRL1_TPQC_OFF (22u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ0 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ0_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ0 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ0_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ0 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ0_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ1 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ1_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ1 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ1_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ1 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ1_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ2 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ2_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ2 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ2_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ2 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ2_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ3 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ3_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ3 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ3_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL2_Bits.PSRQ3 */
#define IFX_GETH_MAC_RXQ_CTRL2_PSRQ3_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_RGSMIIIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_RGSMIIIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_RGSMIIIS_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.PHYIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_PHYIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.PHYIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_PHYIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.PHYIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_PHYIS_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_PMTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_PMTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_PMTIS_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_LPIIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_LPIIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_LPIIS_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCIS_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCRXIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCRXIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCRXIS_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCTXIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCTXIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCTXIS_OFF (10u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCRXIPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCRXIPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MMCRXIPIS_OFF (11u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_TSIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_TSIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_TSIS_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.TXSTSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_TXSTSIS_LEN (1u)

