HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.TXSTSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_TXSTSIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.TXSTSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_TXSTSIS_OFF (13u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.RXSTSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_RXSTSIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.RXSTSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_RXSTSIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.RXSTSIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_RXSTSIS_OFF (14u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MDIOIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MDIOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MDIOIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MDIOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_STATUS_Bits.MDIOIS */
#define IFX_GETH_MAC_INTERRUPT_STATUS_MDIOIS_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.RGSMIIIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_RGSMIIIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.RGSMIIIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_RGSMIIIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.RGSMIIIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_RGSMIIIE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.PHYIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_PHYIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.PHYIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_PHYIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.PHYIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_PHYIE_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.PMTIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_PMTIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.PMTIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_PMTIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.PMTIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_PMTIE_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.LPIIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_LPIIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.LPIIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_LPIIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.LPIIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_LPIIE_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.TSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_TSIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.TSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_TSIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.TSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_TSIE_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.TXSTSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_TXSTSIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.TXSTSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_TXSTSIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.TXSTSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_TXSTSIE_OFF (13u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.RXSTSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_RXSTSIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.RXSTSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_RXSTSIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.RXSTSIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_RXSTSIE_OFF (14u)

/** \brief Length for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.MDIOIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_MDIOIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.MDIOIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_MDIOIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_INTERRUPT_ENABLE_Bits.MDIOIE */
#define IFX_GETH_MAC_INTERRUPT_ENABLE_MDIOIE_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.TJT */
#define IFX_GETH_MAC_RX_TX_STATUS_TJT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.TJT */
#define IFX_GETH_MAC_RX_TX_STATUS_TJT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.TJT */
#define IFX_GETH_MAC_RX_TX_STATUS_TJT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.NCARR */
#define IFX_GETH_MAC_RX_TX_STATUS_NCARR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.NCARR */
#define IFX_GETH_MAC_RX_TX_STATUS_NCARR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.NCARR */
#define IFX_GETH_MAC_RX_TX_STATUS_NCARR_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCARR */
#define IFX_GETH_MAC_RX_TX_STATUS_LCARR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCARR */
#define IFX_GETH_MAC_RX_TX_STATUS_LCARR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCARR */
#define IFX_GETH_MAC_RX_TX_STATUS_LCARR_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXDEF */
#define IFX_GETH_MAC_RX_TX_STATUS_EXDEF_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXDEF */
#define IFX_GETH_MAC_RX_TX_STATUS_EXDEF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXDEF */
#define IFX_GETH_MAC_RX_TX_STATUS_EXDEF_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_LCOL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_LCOL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_LCOL_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_EXCOL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_EXCOL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_EXCOL_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.RWT */
#define IFX_GETH_MAC_RX_TX_STATUS_RWT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.RWT */
#define IFX_GETH_MAC_RX_TX_STATUS_RWT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.RWT */
#define IFX_GETH_MAC_RX_TX_STATUS_RWT_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_PWRDWN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_PWRDWN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_PWRDWN_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPKTEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPKTEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPKTEN_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPKTEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPKTEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPKTEN_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPRCVD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPRCVD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPRCVD_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPRCVD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPRCVD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPRCVD_OFF (6u)

