HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.EEESEL */
#define IFX_GETH_MAC_HW_FEATURE0_EEESEL_OFF (13u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.TXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_TXCOESEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.TXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_TXCOESEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.TXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_TXCOESEL_OFF (14u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.RXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_RXCOESEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.RXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_RXCOESEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.RXCOESEL */
#define IFX_GETH_MAC_HW_FEATURE0_RXCOESEL_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.ADDMACADRSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ADDMACADRSEL_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.ADDMACADRSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ADDMACADRSEL_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.ADDMACADRSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ADDMACADRSEL_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR32SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR32SEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR32SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR32SEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR32SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR32SEL_OFF (23u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR64SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR64SEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR64SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR64SEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MACADR64SEL */
#define IFX_GETH_MAC_HW_FEATURE0_MACADR64SEL_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSTSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSTSSEL_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSTSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSTSSEL_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSTSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSTSSEL_OFF (25u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.SAVLANINS */
#define IFX_GETH_MAC_HW_FEATURE0_SAVLANINS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.SAVLANINS */
#define IFX_GETH_MAC_HW_FEATURE0_SAVLANINS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.SAVLANINS */
#define IFX_GETH_MAC_HW_FEATURE0_SAVLANINS_OFF (27u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.ACTPHYSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ACTPHYSEL_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.ACTPHYSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ACTPHYSEL_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.ACTPHYSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ACTPHYSEL_OFF (28u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.RXFIFOSIZE */
#define IFX_GETH_MAC_HW_FEATURE1_RXFIFOSIZE_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.RXFIFOSIZE */
#define IFX_GETH_MAC_HW_FEATURE1_RXFIFOSIZE_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.RXFIFOSIZE */
#define IFX_GETH_MAC_HW_FEATURE1_RXFIFOSIZE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.SPRAM */
#define IFX_GETH_MAC_HW_FEATURE1_SPRAM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.SPRAM */
#define IFX_GETH_MAC_HW_FEATURE1_SPRAM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.SPRAM */
#define IFX_GETH_MAC_HW_FEATURE1_SPRAM_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.TXFIFOSIZE */
#define IFX_GETH_MAC_HW_FEATURE1_TXFIFOSIZE_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.TXFIFOSIZE */
#define IFX_GETH_MAC_HW_FEATURE1_TXFIFOSIZE_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.TXFIFOSIZE */
#define IFX_GETH_MAC_HW_FEATURE1_TXFIFOSIZE_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.OSTEN */
#define IFX_GETH_MAC_HW_FEATURE1_OSTEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.OSTEN */
#define IFX_GETH_MAC_HW_FEATURE1_OSTEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.OSTEN */
#define IFX_GETH_MAC_HW_FEATURE1_OSTEN_OFF (11u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.PTOEN */
#define IFX_GETH_MAC_HW_FEATURE1_PTOEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.PTOEN */
#define IFX_GETH_MAC_HW_FEATURE1_PTOEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.PTOEN */
#define IFX_GETH_MAC_HW_FEATURE1_PTOEN_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.ADVTHWORD */
#define IFX_GETH_MAC_HW_FEATURE1_ADVTHWORD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.ADVTHWORD */
#define IFX_GETH_MAC_HW_FEATURE1_ADVTHWORD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.ADVTHWORD */
#define IFX_GETH_MAC_HW_FEATURE1_ADVTHWORD_OFF (13u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.ADDR64 */
#define IFX_GETH_MAC_HW_FEATURE1_ADDR64_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.ADDR64 */
#define IFX_GETH_MAC_HW_FEATURE1_ADDR64_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.ADDR64 */
#define IFX_GETH_MAC_HW_FEATURE1_ADDR64_OFF (14u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.DCBEN */
#define IFX_GETH_MAC_HW_FEATURE1_DCBEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.DCBEN */
#define IFX_GETH_MAC_HW_FEATURE1_DCBEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.DCBEN */
#define IFX_GETH_MAC_HW_FEATURE1_DCBEN_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.SPHEN */
#define IFX_GETH_MAC_HW_FEATURE1_SPHEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.SPHEN */
#define IFX_GETH_MAC_HW_FEATURE1_SPHEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.SPHEN */
#define IFX_GETH_MAC_HW_FEATURE1_SPHEN_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.TSOEN */
#define IFX_GETH_MAC_HW_FEATURE1_TSOEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.TSOEN */
#define IFX_GETH_MAC_HW_FEATURE1_TSOEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.TSOEN */
#define IFX_GETH_MAC_HW_FEATURE1_TSOEN_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.DBGMEMA */
#define IFX_GETH_MAC_HW_FEATURE1_DBGMEMA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.DBGMEMA */
#define IFX_GETH_MAC_HW_FEATURE1_DBGMEMA_MSK (0x1u)

