HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.DBGMEMA */
#define IFX_GETH_MAC_HW_FEATURE1_DBGMEMA_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.AVSEL */
#define IFX_GETH_MAC_HW_FEATURE1_AVSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.AVSEL */
#define IFX_GETH_MAC_HW_FEATURE1_AVSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.AVSEL */
#define IFX_GETH_MAC_HW_FEATURE1_AVSEL_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.RAVSEL */
#define IFX_GETH_MAC_HW_FEATURE1_RAVSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.RAVSEL */
#define IFX_GETH_MAC_HW_FEATURE1_RAVSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.RAVSEL */
#define IFX_GETH_MAC_HW_FEATURE1_RAVSEL_OFF (21u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.POUOST */
#define IFX_GETH_MAC_HW_FEATURE1_POUOST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.POUOST */
#define IFX_GETH_MAC_HW_FEATURE1_POUOST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.POUOST */
#define IFX_GETH_MAC_HW_FEATURE1_POUOST_OFF (23u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.HASHTBLSZ */
#define IFX_GETH_MAC_HW_FEATURE1_HASHTBLSZ_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.HASHTBLSZ */
#define IFX_GETH_MAC_HW_FEATURE1_HASHTBLSZ_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.HASHTBLSZ */
#define IFX_GETH_MAC_HW_FEATURE1_HASHTBLSZ_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE1_Bits.L3L4FNUM */
#define IFX_GETH_MAC_HW_FEATURE1_L3L4FNUM_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.L3L4FNUM */
#define IFX_GETH_MAC_HW_FEATURE1_L3L4FNUM_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.L3L4FNUM */
#define IFX_GETH_MAC_HW_FEATURE1_L3L4FNUM_OFF (27u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXQCNT_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXQCNT_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXQCNT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXQCNT_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXQCNT_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXQCNT_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXCHCNT_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXCHCNT_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXCHCNT_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXCHCNT_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXCHCNT_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXCHCNT_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.PPSOUTNUM */
#define IFX_GETH_MAC_HW_FEATURE2_PPSOUTNUM_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.PPSOUTNUM */
#define IFX_GETH_MAC_HW_FEATURE2_PPSOUTNUM_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.PPSOUTNUM */
#define IFX_GETH_MAC_HW_FEATURE2_PPSOUTNUM_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.AUXSNAPNUM */
#define IFX_GETH_MAC_HW_FEATURE2_AUXSNAPNUM_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.AUXSNAPNUM */
#define IFX_GETH_MAC_HW_FEATURE2_AUXSNAPNUM_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.AUXSNAPNUM */
#define IFX_GETH_MAC_HW_FEATURE2_AUXSNAPNUM_OFF (28u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE3_Bits.NRVF */
#define IFX_GETH_MAC_HW_FEATURE3_NRVF_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE3_Bits.NRVF */
#define IFX_GETH_MAC_HW_FEATURE3_NRVF_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE3_Bits.NRVF */
#define IFX_GETH_MAC_HW_FEATURE3_NRVF_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE3_Bits.CBTISEL */
#define IFX_GETH_MAC_HW_FEATURE3_CBTISEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE3_Bits.CBTISEL */
#define IFX_GETH_MAC_HW_FEATURE3_CBTISEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE3_Bits.CBTISEL */
#define IFX_GETH_MAC_HW_FEATURE3_CBTISEL_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE3_Bits.DVLAN */
#define IFX_GETH_MAC_HW_FEATURE3_DVLAN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE3_Bits.DVLAN */
#define IFX_GETH_MAC_HW_FEATURE3_DVLAN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE3_Bits.DVLAN */
#define IFX_GETH_MAC_HW_FEATURE3_DVLAN_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GB */
#define IFX_GETH_MAC_MDIO_ADDRESS_GB_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GB */
#define IFX_GETH_MAC_MDIO_ADDRESS_GB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GB */
#define IFX_GETH_MAC_MDIO_ADDRESS_GB_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.C45E */
#define IFX_GETH_MAC_MDIO_ADDRESS_C45E_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.C45E */
#define IFX_GETH_MAC_MDIO_ADDRESS_C45E_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.C45E */
#define IFX_GETH_MAC_MDIO_ADDRESS_C45E_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_0 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_0_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_0 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_0_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_0 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_0_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_1 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_1_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_1 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_1_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_1 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_1_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.SKAP */
#define IFX_GETH_MAC_MDIO_ADDRESS_SKAP_LEN (1u)

