HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.SKAP */
#define IFX_GETH_MAC_MDIO_ADDRESS_SKAP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.SKAP */
#define IFX_GETH_MAC_MDIO_ADDRESS_SKAP_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.CR */
#define IFX_GETH_MAC_MDIO_ADDRESS_CR_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.CR */
#define IFX_GETH_MAC_MDIO_ADDRESS_CR_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.CR */
#define IFX_GETH_MAC_MDIO_ADDRESS_CR_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.NTC */
#define IFX_GETH_MAC_MDIO_ADDRESS_NTC_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.NTC */
#define IFX_GETH_MAC_MDIO_ADDRESS_NTC_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.NTC */
#define IFX_GETH_MAC_MDIO_ADDRESS_NTC_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.RDA */
#define IFX_GETH_MAC_MDIO_ADDRESS_RDA_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.RDA */
#define IFX_GETH_MAC_MDIO_ADDRESS_RDA_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.RDA */
#define IFX_GETH_MAC_MDIO_ADDRESS_RDA_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PA */
#define IFX_GETH_MAC_MDIO_ADDRESS_PA_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PA */
#define IFX_GETH_MAC_MDIO_ADDRESS_PA_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PA */
#define IFX_GETH_MAC_MDIO_ADDRESS_PA_OFF (21u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.BTB */
#define IFX_GETH_MAC_MDIO_ADDRESS_BTB_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.BTB */
#define IFX_GETH_MAC_MDIO_ADDRESS_BTB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.BTB */
#define IFX_GETH_MAC_MDIO_ADDRESS_BTB_OFF (26u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PSE */
#define IFX_GETH_MAC_MDIO_ADDRESS_PSE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PSE */
#define IFX_GETH_MAC_MDIO_ADDRESS_PSE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PSE */
#define IFX_GETH_MAC_MDIO_ADDRESS_PSE_OFF (27u)

/** \brief Length for Ifx_GETH_MAC_MDIO_DATA_Bits.GD */
#define IFX_GETH_MAC_MDIO_DATA_GD_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_DATA_Bits.GD */
#define IFX_GETH_MAC_MDIO_DATA_GD_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_DATA_Bits.GD */
#define IFX_GETH_MAC_MDIO_DATA_GD_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_MDIO_DATA_Bits.RA */
#define IFX_GETH_MAC_MDIO_DATA_RA_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_DATA_Bits.RA */
#define IFX_GETH_MAC_MDIO_DATA_RA_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_DATA_Bits.RA */
#define IFX_GETH_MAC_MDIO_DATA_RA_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.RCWE */
#define IFX_GETH_MAC_CSR_SW_CTRL_RCWE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.RCWE */
#define IFX_GETH_MAC_CSR_SW_CTRL_RCWE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.RCWE */
#define IFX_GETH_MAC_CSR_SW_CTRL_RCWE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.SEEN */
#define IFX_GETH_MAC_CSR_SW_CTRL_SEEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.SEEN */
#define IFX_GETH_MAC_CSR_SW_CTRL_SEEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.SEEN */
#define IFX_GETH_MAC_CSR_SW_CTRL_SEEN_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLOFST */
#define IFX_GETH_MAC_EXT_CFG1_SPLOFST_LEN (7u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLOFST */
#define IFX_GETH_MAC_EXT_CFG1_SPLOFST_MSK (0x7fu)

/** \brief Offset for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLOFST */
#define IFX_GETH_MAC_EXT_CFG1_SPLOFST_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLM */
#define IFX_GETH_MAC_EXT_CFG1_SPLM_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLM */
#define IFX_GETH_MAC_EXT_CFG1_SPLM_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLM */
#define IFX_GETH_MAC_EXT_CFG1_SPLM_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH0_ADDRHI_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH0_ADDRHI_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH0_ADDRHI_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH0_DCS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH0_DCS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH0_DCS_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH0_AE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH0_AE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH0_AE_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_LOW0_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW0_ADDRLO_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_LOW0_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW0_ADDRLO_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_LOW0_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW0_ADDRLO_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH_ADDRHI_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH_ADDRHI_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH_ADDRHI_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH_DCS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH_DCS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH_DCS_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_GETH_MAC_ADDRESS_HIGH_MBC_LEN (6u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_GETH_MAC_ADDRESS_HIGH_MBC_MSK (0x3fu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_GETH_MAC_ADDRESS_HIGH_MBC_OFF (24u)

