HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_RX_LENGTH_ERROR_PACKETS_Bits.RXLENERR */
#define IFX_GETH_RX_LENGTH_ERROR_PACKETS_RXLENERR_OFF (0u)

/** \brief Length for Ifx_GETH_RX_OUT_OF_RANGE_TYPE_PACKETS_Bits.RXOUTOFRNG */
#define IFX_GETH_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_OUT_OF_RANGE_TYPE_PACKETS_Bits.RXOUTOFRNG */
#define IFX_GETH_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_OUT_OF_RANGE_TYPE_PACKETS_Bits.RXOUTOFRNG */
#define IFX_GETH_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG_OFF (0u)

/** \brief Length for Ifx_GETH_RX_PAUSE_PACKETS_Bits.RXPAUSEPKT */
#define IFX_GETH_RX_PAUSE_PACKETS_RXPAUSEPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_PAUSE_PACKETS_Bits.RXPAUSEPKT */
#define IFX_GETH_RX_PAUSE_PACKETS_RXPAUSEPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_PAUSE_PACKETS_Bits.RXPAUSEPKT */
#define IFX_GETH_RX_PAUSE_PACKETS_RXPAUSEPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RX_FIFO_OVERFLOW_PACKETS_Bits.RXFIFOOVFL */
#define IFX_GETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_FIFO_OVERFLOW_PACKETS_Bits.RXFIFOOVFL */
#define IFX_GETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_FIFO_OVERFLOW_PACKETS_Bits.RXFIFOOVFL */
#define IFX_GETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_OFF (0u)

/** \brief Length for Ifx_GETH_RX_VLAN_PACKETS_GOOD_BAD_Bits.RXVLANPKTGB */
#define IFX_GETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_VLAN_PACKETS_GOOD_BAD_Bits.RXVLANPKTGB */
#define IFX_GETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_VLAN_PACKETS_GOOD_BAD_Bits.RXVLANPKTGB */
#define IFX_GETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_WATCHDOG_ERROR_PACKETS_Bits.RXWDGERR */
#define IFX_GETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_WATCHDOG_ERROR_PACKETS_Bits.RXWDGERR */
#define IFX_GETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_WATCHDOG_ERROR_PACKETS_Bits.RXWDGERR */
#define IFX_GETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_OFF (0u)

/** \brief Length for Ifx_GETH_RX_RECEIVE_ERROR_PACKETS_Bits.RXRCVERR */
#define IFX_GETH_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_RECEIVE_ERROR_PACKETS_Bits.RXRCVERR */
#define IFX_GETH_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_RECEIVE_ERROR_PACKETS_Bits.RXRCVERR */
#define IFX_GETH_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_OFF (0u)

/** \brief Length for Ifx_GETH_RX_CONTROL_PACKETS_GOOD_Bits.RXCTRLG */
#define IFX_GETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_CONTROL_PACKETS_GOOD_Bits.RXCTRLG */
#define IFX_GETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_CONTROL_PACKETS_GOOD_Bits.RXCTRLG */
#define IFX_GETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG_OFF (0u)

/** \brief Length for Ifx_GETH_TX_LPI_USEC_CNTR_Bits.TXLPIUSC */
#define IFX_GETH_TX_LPI_USEC_CNTR_TXLPIUSC_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_LPI_USEC_CNTR_Bits.TXLPIUSC */
#define IFX_GETH_TX_LPI_USEC_CNTR_TXLPIUSC_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_LPI_USEC_CNTR_Bits.TXLPIUSC */
#define IFX_GETH_TX_LPI_USEC_CNTR_TXLPIUSC_OFF (0u)

/** \brief Length for Ifx_GETH_TX_LPI_TRAN_CNTR_Bits.TXLPITRC */
#define IFX_GETH_TX_LPI_TRAN_CNTR_TXLPITRC_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_LPI_TRAN_CNTR_Bits.TXLPITRC */
#define IFX_GETH_TX_LPI_TRAN_CNTR_TXLPITRC_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_LPI_TRAN_CNTR_Bits.TXLPITRC */
#define IFX_GETH_TX_LPI_TRAN_CNTR_TXLPITRC_OFF (0u)

/** \brief Length for Ifx_GETH_RX_LPI_USEC_CNTR_Bits.RXLPIUSC */
#define IFX_GETH_RX_LPI_USEC_CNTR_RXLPIUSC_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_LPI_USEC_CNTR_Bits.RXLPIUSC */
#define IFX_GETH_RX_LPI_USEC_CNTR_RXLPIUSC_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_LPI_USEC_CNTR_Bits.RXLPIUSC */
#define IFX_GETH_RX_LPI_USEC_CNTR_RXLPIUSC_OFF (0u)

/** \brief Length for Ifx_GETH_RX_LPI_TRAN_CNTR_Bits.RXLPITRC */
#define IFX_GETH_RX_LPI_TRAN_CNTR_RXLPITRC_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_LPI_TRAN_CNTR_Bits.RXLPITRC */
#define IFX_GETH_RX_LPI_TRAN_CNTR_RXLPITRC_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_LPI_TRAN_CNTR_Bits.RXLPITRC */
#define IFX_GETH_RX_LPI_TRAN_CNTR_RXLPITRC_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4GPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4GPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4GPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GPIM_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4HERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4HERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4HERPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HERPIM_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4NOPAYPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4NOPAYPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4NOPAYPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYPIM_OFF (2u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4FRAGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4FRAGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4FRAGPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGPIM_OFF (3u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4UDSBLPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4UDSBLPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV4UDSBLPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLPIM_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6GPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6GPIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GPIM_MSK (0x1u)

