HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_DMA_MODE_Bits.TAA */
#define IFX_GETH_DMA_MODE_TAA_LEN (3u)

/** \brief Mask for Ifx_GETH_DMA_MODE_Bits.TAA */
#define IFX_GETH_DMA_MODE_TAA_MSK (0x7u)

/** \brief Offset for Ifx_GETH_DMA_MODE_Bits.TAA */
#define IFX_GETH_DMA_MODE_TAA_OFF (2u)

/** \brief Length for Ifx_GETH_DMA_MODE_Bits.ARBC */
#define IFX_GETH_DMA_MODE_ARBC_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_MODE_Bits.ARBC */
#define IFX_GETH_DMA_MODE_ARBC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_MODE_Bits.ARBC */
#define IFX_GETH_DMA_MODE_ARBC_OFF (9u)

/** \brief Length for Ifx_GETH_DMA_MODE_Bits.TXPR */
#define IFX_GETH_DMA_MODE_TXPR_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_MODE_Bits.TXPR */
#define IFX_GETH_DMA_MODE_TXPR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_MODE_Bits.TXPR */
#define IFX_GETH_DMA_MODE_TXPR_OFF (11u)

/** \brief Length for Ifx_GETH_DMA_MODE_Bits.PR */
#define IFX_GETH_DMA_MODE_PR_LEN (3u)

/** \brief Mask for Ifx_GETH_DMA_MODE_Bits.PR */
#define IFX_GETH_DMA_MODE_PR_MSK (0x7u)

/** \brief Offset for Ifx_GETH_DMA_MODE_Bits.PR */
#define IFX_GETH_DMA_MODE_PR_OFF (12u)

/** \brief Length for Ifx_GETH_DMA_MODE_Bits.INTM */
#define IFX_GETH_DMA_MODE_INTM_LEN (2u)

/** \brief Mask for Ifx_GETH_DMA_MODE_Bits.INTM */
#define IFX_GETH_DMA_MODE_INTM_MSK (0x3u)

/** \brief Offset for Ifx_GETH_DMA_MODE_Bits.INTM */
#define IFX_GETH_DMA_MODE_INTM_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_SYSBUS_MODE_Bits.FB */
#define IFX_GETH_DMA_SYSBUS_MODE_FB_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_SYSBUS_MODE_Bits.FB */
#define IFX_GETH_DMA_SYSBUS_MODE_FB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_SYSBUS_MODE_Bits.FB */
#define IFX_GETH_DMA_SYSBUS_MODE_FB_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_SYSBUS_MODE_Bits.AAL */
#define IFX_GETH_DMA_SYSBUS_MODE_AAL_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_SYSBUS_MODE_Bits.AAL */
#define IFX_GETH_DMA_SYSBUS_MODE_AAL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_SYSBUS_MODE_Bits.AAL */
#define IFX_GETH_DMA_SYSBUS_MODE_AAL_OFF (12u)

/** \brief Length for Ifx_GETH_DMA_SYSBUS_MODE_Bits.MB */
#define IFX_GETH_DMA_SYSBUS_MODE_MB_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_SYSBUS_MODE_Bits.MB */
#define IFX_GETH_DMA_SYSBUS_MODE_MB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_SYSBUS_MODE_Bits.MB */
#define IFX_GETH_DMA_SYSBUS_MODE_MB_OFF (14u)

/** \brief Length for Ifx_GETH_DMA_SYSBUS_MODE_Bits.RB */
#define IFX_GETH_DMA_SYSBUS_MODE_RB_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_SYSBUS_MODE_Bits.RB */
#define IFX_GETH_DMA_SYSBUS_MODE_RB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_SYSBUS_MODE_Bits.RB */
#define IFX_GETH_DMA_SYSBUS_MODE_RB_OFF (15u)

/** \brief Length for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC0IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC0IS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC0IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC0IS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC0IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC0IS_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC1IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC1IS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC1IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC1IS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC1IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC1IS_OFF (1u)

/** \brief Length for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC2IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC2IS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC2IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC2IS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC2IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC2IS_OFF (2u)

/** \brief Length for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC3IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC3IS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC3IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC3IS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.DC3IS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_DC3IS_OFF (3u)

/** \brief Length for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.MTLIS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_MTLIS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.MTLIS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_MTLIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.MTLIS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_MTLIS_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.MACIS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_MACIS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.MACIS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_MACIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_INTERRUPT_STATUS_Bits.MACIS */
#define IFX_GETH_DMA_INTERRUPT_STATUS_MACIS_OFF (17u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.AXWHSTS */
#define IFX_GETH_DMA_DEBUG_STATUS0_AXWHSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.AXWHSTS */
#define IFX_GETH_DMA_DEBUG_STATUS0_AXWHSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.AXWHSTS */
#define IFX_GETH_DMA_DEBUG_STATUS0_AXWHSTS_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS0 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS0_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS0 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS0_MSK (0xfu)

/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS0 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS0_OFF (8u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS0 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS0_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS0 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS0_MSK (0xfu)

/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS0 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS0_OFF (12u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS1 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS1_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS1 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS1_MSK (0xfu)

/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS1 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS1_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS1 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS1_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS1 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS1_MSK (0xfu)

/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS1 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS1_OFF (20u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS2 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS2_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS2 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS2_MSK (0xfu)

/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.RPS2 */
#define IFX_GETH_DMA_DEBUG_STATUS0_RPS2_OFF (24u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS2 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS2_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS2 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS2_MSK (0xfu)

/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS0_Bits.TPS2 */
#define IFX_GETH_DMA_DEBUG_STATUS0_TPS2_OFF (28u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS1_Bits.RPS3 */
#define IFX_GETH_DMA_DEBUG_STATUS1_RPS3_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS1_Bits.RPS3 */
#define IFX_GETH_DMA_DEBUG_STATUS1_RPS3_MSK (0xfu)

