HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS1_Bits.RPS3 */
#define IFX_GETH_DMA_DEBUG_STATUS1_RPS3_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_DEBUG_STATUS1_Bits.TPS3 */
#define IFX_GETH_DMA_DEBUG_STATUS1_TPS3_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_DEBUG_STATUS1_Bits.TPS3 */
#define IFX_GETH_DMA_DEBUG_STATUS1_TPS3_MSK (0xfu)

/** \brief Offset for Ifx_GETH_DMA_DEBUG_STATUS1_Bits.TPS3 */
#define IFX_GETH_DMA_DEBUG_STATUS1_TPS3_OFF (4u)

/** \brief Length for Ifx_GETH_DMA_CH_CONTROL_Bits.PBLx8 */
#define IFX_GETH_DMA_CH_CONTROL_PBLX8_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_CONTROL_Bits.PBLx8 */
#define IFX_GETH_DMA_CH_CONTROL_PBLX8_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_CONTROL_Bits.PBLx8 */
#define IFX_GETH_DMA_CH_CONTROL_PBLX8_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_CH_CONTROL_Bits.DSL */
#define IFX_GETH_DMA_CH_CONTROL_DSL_LEN (3u)

/** \brief Mask for Ifx_GETH_DMA_CH_CONTROL_Bits.DSL */
#define IFX_GETH_DMA_CH_CONTROL_DSL_MSK (0x7u)

/** \brief Offset for Ifx_GETH_DMA_CH_CONTROL_Bits.DSL */
#define IFX_GETH_DMA_CH_CONTROL_DSL_OFF (18u)

/** \brief Length for Ifx_GETH_DMA_CH_CONTROL_Bits.SPH */
#define IFX_GETH_DMA_CH_CONTROL_SPH_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_CONTROL_Bits.SPH */
#define IFX_GETH_DMA_CH_CONTROL_SPH_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_CONTROL_Bits.SPH */
#define IFX_GETH_DMA_CH_CONTROL_SPH_OFF (24u)

/** \brief Length for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.ST */
#define IFX_GETH_DMA_CH_TX_CONTROL_ST_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.ST */
#define IFX_GETH_DMA_CH_TX_CONTROL_ST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.ST */
#define IFX_GETH_DMA_CH_TX_CONTROL_ST_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.TCW */
#define IFX_GETH_DMA_CH_TX_CONTROL_TCW_LEN (3u)

/** \brief Mask for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.TCW */
#define IFX_GETH_DMA_CH_TX_CONTROL_TCW_MSK (0x7u)

/** \brief Offset for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.TCW */
#define IFX_GETH_DMA_CH_TX_CONTROL_TCW_OFF (1u)

/** \brief Length for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.OSF */
#define IFX_GETH_DMA_CH_TX_CONTROL_OSF_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.OSF */
#define IFX_GETH_DMA_CH_TX_CONTROL_OSF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.OSF */
#define IFX_GETH_DMA_CH_TX_CONTROL_OSF_OFF (4u)

/** \brief Length for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.TxPBL */
#define IFX_GETH_DMA_CH_TX_CONTROL_TXPBL_LEN (6u)

/** \brief Mask for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.TxPBL */
#define IFX_GETH_DMA_CH_TX_CONTROL_TXPBL_MSK (0x3fu)

/** \brief Offset for Ifx_GETH_DMA_CH_TX_CONTROL_Bits.TxPBL */
#define IFX_GETH_DMA_CH_TX_CONTROL_TXPBL_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.SR */
#define IFX_GETH_DMA_CH_RX_CONTROL_SR_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.SR */
#define IFX_GETH_DMA_CH_RX_CONTROL_SR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.SR */
#define IFX_GETH_DMA_CH_RX_CONTROL_SR_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RBSZ_x_0 */
#define IFX_GETH_DMA_CH_RX_CONTROL_RBSZ_X_0_LEN (2u)

/** \brief Mask for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RBSZ_x_0 */
#define IFX_GETH_DMA_CH_RX_CONTROL_RBSZ_X_0_MSK (0x3u)

/** \brief Offset for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RBSZ_x_0 */
#define IFX_GETH_DMA_CH_RX_CONTROL_RBSZ_X_0_OFF (1u)

/** \brief Length for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RBSZ_13_y */
#define IFX_GETH_DMA_CH_RX_CONTROL_RBSZ_13_Y_LEN (12u)

/** \brief Mask for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RBSZ_13_y */
#define IFX_GETH_DMA_CH_RX_CONTROL_RBSZ_13_Y_MSK (0xfffu)

/** \brief Offset for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RBSZ_13_y */
#define IFX_GETH_DMA_CH_RX_CONTROL_RBSZ_13_Y_OFF (3u)

/** \brief Length for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RxPBL */
#define IFX_GETH_DMA_CH_RX_CONTROL_RXPBL_LEN (6u)

/** \brief Mask for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RxPBL */
#define IFX_GETH_DMA_CH_RX_CONTROL_RXPBL_MSK (0x3fu)

/** \brief Offset for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RxPBL */
#define IFX_GETH_DMA_CH_RX_CONTROL_RXPBL_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RPF */
#define IFX_GETH_DMA_CH_RX_CONTROL_RPF_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RPF */
#define IFX_GETH_DMA_CH_RX_CONTROL_RPF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_RX_CONTROL_Bits.RPF */
#define IFX_GETH_DMA_CH_RX_CONTROL_RPF_OFF (31u)

/** \brief Length for Ifx_GETH_DMA_CH_TXDESC_LIST_ADDRESS_Bits.TDESLA */
#define IFX_GETH_DMA_CH_TXDESC_LIST_ADDRESS_TDESLA_LEN (30u)

/** \brief Mask for Ifx_GETH_DMA_CH_TXDESC_LIST_ADDRESS_Bits.TDESLA */
#define IFX_GETH_DMA_CH_TXDESC_LIST_ADDRESS_TDESLA_MSK (0x3fffffffu)

/** \brief Offset for Ifx_GETH_DMA_CH_TXDESC_LIST_ADDRESS_Bits.TDESLA */
#define IFX_GETH_DMA_CH_TXDESC_LIST_ADDRESS_TDESLA_OFF (2u)

/** \brief Length for Ifx_GETH_DMA_CH_RXDESC_LIST_ADDRESS_Bits.RDESLA */
#define IFX_GETH_DMA_CH_RXDESC_LIST_ADDRESS_RDESLA_LEN (30u)

/** \brief Mask for Ifx_GETH_DMA_CH_RXDESC_LIST_ADDRESS_Bits.RDESLA */
#define IFX_GETH_DMA_CH_RXDESC_LIST_ADDRESS_RDESLA_MSK (0x3fffffffu)

/** \brief Offset for Ifx_GETH_DMA_CH_RXDESC_LIST_ADDRESS_Bits.RDESLA */
#define IFX_GETH_DMA_CH_RXDESC_LIST_ADDRESS_RDESLA_OFF (2u)

/** \brief Length for Ifx_GETH_DMA_CH_TXDESC_TAIL_POINTER_Bits.TDTP */
#define IFX_GETH_DMA_CH_TXDESC_TAIL_POINTER_TDTP_LEN (30u)

/** \brief Mask for Ifx_GETH_DMA_CH_TXDESC_TAIL_POINTER_Bits.TDTP */
#define IFX_GETH_DMA_CH_TXDESC_TAIL_POINTER_TDTP_MSK (0x3fffffffu)

/** \brief Offset for Ifx_GETH_DMA_CH_TXDESC_TAIL_POINTER_Bits.TDTP */
#define IFX_GETH_DMA_CH_TXDESC_TAIL_POINTER_TDTP_OFF (2u)

/** \brief Length for Ifx_GETH_DMA_CH_RXDESC_TAIL_POINTER_Bits.RDTP */
#define IFX_GETH_DMA_CH_RXDESC_TAIL_POINTER_RDTP_LEN (30u)

/** \brief Mask for Ifx_GETH_DMA_CH_RXDESC_TAIL_POINTER_Bits.RDTP */
#define IFX_GETH_DMA_CH_RXDESC_TAIL_POINTER_RDTP_MSK (0x3fffffffu)

/** \brief Offset for Ifx_GETH_DMA_CH_RXDESC_TAIL_POINTER_Bits.RDTP */
#define IFX_GETH_DMA_CH_RXDESC_TAIL_POINTER_RDTP_OFF (2u)

/** \brief Length for Ifx_GETH_DMA_CH_TXDESC_RING_LENGTH_Bits.TDRL */
#define IFX_GETH_DMA_CH_TXDESC_RING_LENGTH_TDRL_LEN (10u)

/** \brief Mask for Ifx_GETH_DMA_CH_TXDESC_RING_LENGTH_Bits.TDRL */
#define IFX_GETH_DMA_CH_TXDESC_RING_LENGTH_TDRL_MSK (0x3ffu)

/** \brief Offset for Ifx_GETH_DMA_CH_TXDESC_RING_LENGTH_Bits.TDRL */
#define IFX_GETH_DMA_CH_TXDESC_RING_LENGTH_TDRL_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_RXDESC_RING_LENGTH_Bits.RDRL */
#define IFX_GETH_DMA_CH_RXDESC_RING_LENGTH_RDRL_LEN (10u)

/** \brief Mask for Ifx_GETH_DMA_CH_RXDESC_RING_LENGTH_Bits.RDRL */
#define IFX_GETH_DMA_CH_RXDESC_RING_LENGTH_RDRL_MSK (0x3ffu)

/** \brief Offset for Ifx_GETH_DMA_CH_RXDESC_RING_LENGTH_Bits.RDRL */
#define IFX_GETH_DMA_CH_RXDESC_RING_LENGTH_RDRL_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TIE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TIE_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TXSE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TXSE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TXSE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TXSE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TXSE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TXSE_OFF (1u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TBUE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TBUE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TBUE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TBUE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.TBUE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_TBUE_OFF (2u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RIE_LEN (1u)

