HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN12 */
#define IFX_GETH_ACCEND_ACCEN0D_EN12_OFF (12u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN13 */
#define IFX_GETH_ACCEND_ACCEN0D_EN13_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN13 */
#define IFX_GETH_ACCEND_ACCEN0D_EN13_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN13 */
#define IFX_GETH_ACCEND_ACCEN0D_EN13_OFF (13u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN14 */
#define IFX_GETH_ACCEND_ACCEN0D_EN14_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN14 */
#define IFX_GETH_ACCEND_ACCEN0D_EN14_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN14 */
#define IFX_GETH_ACCEND_ACCEN0D_EN14_OFF (14u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN15 */
#define IFX_GETH_ACCEND_ACCEN0D_EN15_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN15 */
#define IFX_GETH_ACCEND_ACCEN0D_EN15_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN15 */
#define IFX_GETH_ACCEND_ACCEN0D_EN15_OFF (15u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN16 */
#define IFX_GETH_ACCEND_ACCEN0D_EN16_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN16 */
#define IFX_GETH_ACCEND_ACCEN0D_EN16_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN16 */
#define IFX_GETH_ACCEND_ACCEN0D_EN16_OFF (16u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN17 */
#define IFX_GETH_ACCEND_ACCEN0D_EN17_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN17 */
#define IFX_GETH_ACCEND_ACCEN0D_EN17_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN17 */
#define IFX_GETH_ACCEND_ACCEN0D_EN17_OFF (17u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN18 */
#define IFX_GETH_ACCEND_ACCEN0D_EN18_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN18 */
#define IFX_GETH_ACCEND_ACCEN0D_EN18_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN18 */
#define IFX_GETH_ACCEND_ACCEN0D_EN18_OFF (18u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN19 */
#define IFX_GETH_ACCEND_ACCEN0D_EN19_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN19 */
#define IFX_GETH_ACCEND_ACCEN0D_EN19_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN19 */
#define IFX_GETH_ACCEND_ACCEN0D_EN19_OFF (19u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN20 */
#define IFX_GETH_ACCEND_ACCEN0D_EN20_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN20 */
#define IFX_GETH_ACCEND_ACCEN0D_EN20_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN20 */
#define IFX_GETH_ACCEND_ACCEN0D_EN20_OFF (20u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN21 */
#define IFX_GETH_ACCEND_ACCEN0D_EN21_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN21 */
#define IFX_GETH_ACCEND_ACCEN0D_EN21_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN21 */
#define IFX_GETH_ACCEND_ACCEN0D_EN21_OFF (21u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN22 */
#define IFX_GETH_ACCEND_ACCEN0D_EN22_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN22 */
#define IFX_GETH_ACCEND_ACCEN0D_EN22_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN22 */
#define IFX_GETH_ACCEND_ACCEN0D_EN22_OFF (22u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN23 */
#define IFX_GETH_ACCEND_ACCEN0D_EN23_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN23 */
#define IFX_GETH_ACCEND_ACCEN0D_EN23_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN23 */
#define IFX_GETH_ACCEND_ACCEN0D_EN23_OFF (23u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN24 */
#define IFX_GETH_ACCEND_ACCEN0D_EN24_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN24 */
#define IFX_GETH_ACCEND_ACCEN0D_EN24_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN24 */
#define IFX_GETH_ACCEND_ACCEN0D_EN24_OFF (24u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN25 */
#define IFX_GETH_ACCEND_ACCEN0D_EN25_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN25 */
#define IFX_GETH_ACCEND_ACCEN0D_EN25_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN25 */
#define IFX_GETH_ACCEND_ACCEN0D_EN25_OFF (25u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN26 */
#define IFX_GETH_ACCEND_ACCEN0D_EN26_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN26 */
#define IFX_GETH_ACCEND_ACCEN0D_EN26_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN26 */
#define IFX_GETH_ACCEND_ACCEN0D_EN26_OFF (26u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN27 */
#define IFX_GETH_ACCEND_ACCEN0D_EN27_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN27 */
#define IFX_GETH_ACCEND_ACCEN0D_EN27_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN27 */
#define IFX_GETH_ACCEND_ACCEN0D_EN27_OFF (27u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN28 */
#define IFX_GETH_ACCEND_ACCEN0D_EN28_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN28 */
#define IFX_GETH_ACCEND_ACCEN0D_EN28_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN28 */
#define IFX_GETH_ACCEND_ACCEN0D_EN28_OFF (28u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN29 */
#define IFX_GETH_ACCEND_ACCEN0D_EN29_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN29 */
#define IFX_GETH_ACCEND_ACCEN0D_EN29_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN29 */
#define IFX_GETH_ACCEND_ACCEN0D_EN29_OFF (29u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN30 */
#define IFX_GETH_ACCEND_ACCEN0D_EN30_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN30 */
#define IFX_GETH_ACCEND_ACCEN0D_EN30_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN30 */
#define IFX_GETH_ACCEND_ACCEN0D_EN30_OFF (30u)

/** \brief Length for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN31 */
#define IFX_GETH_ACCEND_ACCEN0D_EN31_LEN (1u)

/** \brief Mask for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN31 */
#define IFX_GETH_ACCEND_ACCEN0D_EN31_MSK (0x1u)

/** \brief Offset for Ifx_GETH_ACCEND_ACCEN0D_Bits.EN31 */
#define IFX_GETH_ACCEND_ACCEN0D_EN31_OFF (31u)

/** \brief Length for Ifx_GETH_SKEWCTL_Bits.TXCFG */
#define IFX_GETH_SKEWCTL_TXCFG_LEN (4u)

/** \brief Mask for Ifx_GETH_SKEWCTL_Bits.TXCFG */
#define IFX_GETH_SKEWCTL_TXCFG_MSK (0xfu)

/** \brief Offset for Ifx_GETH_SKEWCTL_Bits.TXCFG */
#define IFX_GETH_SKEWCTL_TXCFG_OFF (0u)

/** \brief Length for Ifx_GETH_SKEWCTL_Bits.RXCFG */
#define IFX_GETH_SKEWCTL_RXCFG_LEN (4u)

/** \brief Mask for Ifx_GETH_SKEWCTL_Bits.RXCFG */
#define IFX_GETH_SKEWCTL_RXCFG_MSK (0xfu)

/** \brief Offset for Ifx_GETH_SKEWCTL_Bits.RXCFG */
#define IFX_GETH_SKEWCTL_RXCFG_OFF (8u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXGETH_BF_H */
